app/controllers/recipes_controller.rb

SELECT * FROM "recipes" WHERE (contents LIKE '%beef%') LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "recipes"
---
  def index
    @recipes = Recipe.search(params[:search]).paginate page: params[:page], per_page: 30

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def show
    @recipe = Recipe.find(params[:id]).scale(params[:serving])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 19)
---
  def edit
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("created_at", "updated_at", "contents") VALUES('2011-09-17 07:29:46', '2011-09-17 07:29:46', 'Bo La Lot (Betel Wrapped Beef) This recipe can make about 20-24 rolls.
SELECT "recipes".id FROM "recipes" WHERE ("recipes"."contents" = 'Bo La Lot (Betel Wrapped Beef) This recipe can make about 20-24 rolls.
---
  def create
    if params[:unparsed_contents]
      @recipe = Recipe.new.parse(params[:unparsed_contents])
    else
      @recipe = Recipe.new(params[:recipe])
    end
    if @recipe.save
      flash[:success] = "Recipe saved"
      redirect_to recipes_path
    else
      flash.now[:error] = @recipe.errors.full_messages.join("\n")

SELECT * FROM "recipes" WHERE ("recipes"."id" = 19)
UPDATE "recipes" SET "updated_at" = '2011-09-17 07:30:04', "contents" = 'Bo La Lot (Betel Wrapped Beef)
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 12)
DELETE FROM "recipes" WHERE "id" = 12
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy